<template>
    <nav>
        <div class="left">
            <img src="./image/logo.png" alt="Logo">
        </div>
        <div class="right">
            <ul>

                <li>
                    <svg t="1694854044168" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="1042" width="16" height="16">
                        <path
                            d="M510.976 167.936c2.048 0 5.12 0.512 9.216 2.56l328.704 209.92c5.12 3.072 7.168 8.192 7.168 13.312V839.68c0 9.216-7.168 16.384-16.384 16.384H184.32c-9.216 0-16.384-7.168-16.384-16.384V393.728c0-5.632 3.072-10.752 7.168-13.312L501.76 171.008c3.584-2.56 7.168-3.072 9.216-3.072m0-65.536c-15.36 0-30.72 4.608-44.032 13.312L140.288 324.608c-23.552 15.36-37.888 40.96-37.888 68.608V839.68c0 45.056 36.864 81.92 81.92 81.92h655.36c45.056 0 81.92-36.352 81.92-81.92V393.728c0-27.648-14.336-54.272-37.888-68.608l-328.704-209.92c-13.312-8.704-28.672-12.8-44.032-12.8z"
                            fill="#333333" p-id="1043"></path>
                        <path
                            d="M659.456 709.12H364.544c-17.92 0-32.768 14.848-32.768 32.768s14.848 32.768 32.768 32.768h294.912c17.92 0 32.768-14.848 32.768-32.768 0-17.92-14.848-32.768-32.768-32.768z"
                            fill="#333333" p-id="1044"></path>
                    </svg>
                    <a href="/">首页</a>
                </li>
                <li>
                    <svg t="1694854095155" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="1569" width="16" height="16">
                        <path
                            d="M494.08 867.84c-209.408 0-379.392-169.984-379.392-379.392s170.496-379.904 379.392-379.904 379.904 170.496 379.904 379.392-170.496 379.904-379.904 379.904z m0-697.344c-175.104 0-317.44 142.336-317.44 317.44s142.336 317.44 317.44 317.44 317.44-142.336 317.44-317.44-142.336-317.44-317.44-317.44z"
                            fill="#333333" p-id="1570"></path>
                        <path
                            d="M451.072 655.872c-97.28 0-175.616-78.848-175.616-175.616 0-18.432 14.848-33.28 33.28-33.28s33.28 14.848 33.28 33.28c0 59.904 49.152 109.056 109.056 109.056 18.432 0 33.28 14.848 33.28 33.28 0 17.92-14.848 33.28-33.28 33.28zM876.544 915.456c-8.192 0-16.384-3.072-23.04-9.216l-128.512-125.952c-13.312-13.312-13.824-34.816-1.536-48.64 12.8-13.824 33.28-14.336 46.592-1.536l128.512 125.952c13.312 13.312 13.824 34.816 1.536 48.64-6.144 7.68-15.36 10.752-23.552 10.752z"
                            fill="#333333" p-id="1571"></path>
                    </svg><a href="/orders">查看订单</a>
                </li>
            </ul>
        </div>
    </nav>
</template>
  
<style scoped>
nav {
    background-color: white;
    color: #333;
    display: flex;
    justify-content: space-between;
    align-items: center;
    padding: 5px 20px;
    box-shadow: 0px 2px 4px rgba(0, 0, 0, 0.1);
    /* 添加下边界的阴影效果 */

    /* 隐藏光标，将光标颜色设置为透明 */
    caret-color: transparent;
    margin-bottom: 10px;
}

.left img {
    max-width: 100px;
}

.right {
    margin-right: 15.5%;
}

.right ul {
    list-style-type: none;
    padding: 0;
    display: flex;
    justify-content: flex-end;
}

.right li {
    margin-left: 20px;
}

a {
    text-decoration: none;
    color: #333;
}

li {
    display: flex;
    align-items: center;
    /* 垂直居中对齐图标和文字 */
}

.icon {
    width: 16px;
    /* 设置图标的宽度，可以根据需要调整 */
    height: 16px;
    /* 设置图标的高度，可以根据需要调整 */
    margin-right: 8px;
    /* 调整图标与文字之间的间距，可以根据需要调整 */
}
</style>
  